%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% date:2019年2月16日
% author:wxt
% purpose:重庆两栖车 整车基本参数 控制参数
%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 车辆基本参数
g=9.81;%重力加速度
% Radius=0.19;%主动轮半径0.19m\
Radius=0.20;%主动轮半径0.19m
% Mass=2500;
Mass=3700;
G=Mass*g;
L=3.12;%履带接地长
B=2.25;%两侧履带中心距
% eff_tran=0.9;%传动系效率
eff_tran=0.75;%传动系效率
% tras_ratio=8.2;
tras_ratio=6.2;



%电机基本参数
% spd_map_mot=[0 200 400 600 800 1000]*tras_ratio;
% trq_map_mot=[1000 1000 500 334 250 200]/tras_ratio;
% spdmax=7380;%电机最高转速rpm
% trqmax=1000/tras_ratio;
spd_map_mot=[0 100 200 300 360 400 500 600 700 800 900]*tras_ratio;
trq_map_mot=[1200 1200 1200 1200 1200 1080 864 720 617 540 480]/tras_ratio;
spdmax=900*tras_ratio;%电机最高转速rpm
% trqmax=1200/tras_ratio;
trqmax=80;
trqmax_yd=200;
%制动压力与制动0-100的关系
% bratrq_max=4*1255;%在路面状况识别模块没有做出来之前，最大制动力先按照这个计算
% brakepre_dem_data=[0 1 2 3 4 5 6 7 8 9 10];%单位Mpa
% brakeTrq_dem_data=[0 125 251 376 502 627 753 878 1004 1129 1255];%单位Nm
% premax=10;%制动系统最大压力10MPA
bratrq_max=4*2618.376;%在路面状况识别模块没有做出来之前，最大制动力先按照这个计算
brakepre_dem_data=[0 1 2 3 4 5 6 7 8 9 10 11 12];%单位Mpa
brakeTrq_dem_data=[0 218.198 436.396 654.594 872.792 1090.99 1309.188 1527.386 1745.584 1963.782 2181.98 2400.178 2618.376];%单位Nm
premax=12;%制动系统最大压力10MPA








%% 控制参数
v_thr_park=5;     %驻车车速阈值，小于5km/h可进入驻车模式
speed_thr_park=5/3.6/Radius*30/pi;     %驻车电机转速阈值，小于5km/h可进入驻车模式
ag_thr=0.4*g;  %转向时侧向加速度阈值

%车身稳定性控制系统
kp1=1;
ki1=1;
kd1=1;
% 同侧双电机故障，施加的制动压力
% bra_pre_gz2=8.5/3;
% bra_pre_gz34=8.5/3;
bra_pre_gz2=12/3;
bra_pre_gz34=12/3;
% 左转时，右前（后）轮滑转，pid参数
kp2=1;
ki2=1;
kd2=1;
%判断车轮滑转时，为了实现Rely的功能的门限值
s_opt_zhuan_add=0.05;
%判断车轮滑移时，为了实现Rely的功能的门限值
s_opt_yi_add=0.05;
%ABS模块pid参数
kp3=1;
ki3=1;
kd3=1;
%制动能量回收门限值
v_thr1_b=5;%小于5km/h进行机械制动
v_thr2_b=20;%5-15之间进行复合制动
v_thr3_b=20;%大于20才进行防抱死判断
%原地转向时，一侧双电机故障，为原地转向，而施加的制动力
% bra_pre_yd=8.5/2;
bra_pre_yd=12/2;
%紧急制动模式，给的制动压力
% bra_pre_em=8.5;
bra_pre_em=12;





